In [8]:
import numpy as np
import pandas as pd
import seaborn as sns

In [9]:
import warnings
warnings.filterwarnings('ignore')

# Q1

## a

In [10]:
iris = sns.load_dataset('iris')
iris

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [11]:
iris.groupby('species').agg(['mean', 'std'])

           sepal_length           sepal_width  ... petal_length petal_width
                   mean       std        mean  ...          std        mean       std
species                                        ...
setosa            5.006  0.352490       3.428  ...     0.173664       0.246  0.105386
versicolor        5.936  0.516171       2.770  ...     0.469911       1.326  0.197753
virginica         6.588  0.635880       2.974  ...     0.551895       2.026  0.274650

[3 rows x 8 columns]

In [12]:
iris.groupby('species').describe().T

species                setosa  versicolor  virginica
sepal_length count  50.000000   50.000000  50.000000
             mean    5.006000    5.936000   6.588000
             std     0.352490    0.516171   0.635880
             min     4.300000    4.900000   4.900000
             25%     4.800000    5.600000   6.225000
             50%     5.000000    5.900000   6.500000
             75%     5.200000    6.300000   6.900000
             max     5.800000    7.000000   7.900000
sepal_width  count  50.000000   50.000000  50.000000
             mean    3.428000    2.770000   2.974000
             std     0.379064    0.313798   0.322497
             min     2.300000    2.000000   2.200000
             25%     3.200000    2.525000   2.800000
             50%     3.400000    2.800000   3.000000
             75%     3.675000    3.000000   3.175000
             max     4.400000    3.400000   3.800000
petal_length count  50.000000   50.000000  50.000000
             mean    1.462000    4.260000   5.552000
             std     0.173664    0.469911   0.551895
             min     1.000000    3.000000   4.500000
             25%     1.400000    4.000000   5.100000
             50%     1.500000    4.350000   5.550000
             75%     1.575000    4.600000   5.875000
             max     1.900000    5.100000   6.900000
petal_width  count  50.000000   50.000000  50.000000
             mean    0.246000    1.326000   2.026000
             std     0.105386    0.197753   0.274650
             min     0.100000    1.000000   1.400000
             25%     0.200000    1.200000   1.800000
             50%     0.200000    1.300000   2.000000
             75%     0.300000    1.500000   2.300000
             max     0.600000    1.800000   2.500000

## b

In [13]:
s = iris[iris.species=='setosa']['sepal_length']

In [15]:
lower = q1 - 1.5 * iqr
upper = q3 + 1.5 * iqr
s[(s < lower) | (s > upper)] = np.nan
s.isnull().sum()

NameError: ignored

In [14]:
def get_new_stat(s):
  q1, q3 = s.quantile(.25), s.quantile(.75)
  iqr = q3 - q1
  lower = q1 - 1.5 * iqr
  upper = q3 + 1.5 * iqr
  s[(s < lower) | (s > upper)] = np.nan
  outlier = s.isnull().sum() != 0
  return outlier, np.round(s.mean(),2), np.round(s.std(), 4)

In [ ]:
species_list, feature_list, mean_list, std_list = [], [], [], []
outlier_list, new_mean_list, new_std_list = [], [], []
for species in iris.species.unique():
  for feature in iris.columns[:-1]:
    s = iris[iris.species == species][feature]
    species_list.append(species)
    feature_list.append(feature)
    mean_list.append(np.round(s.mean(),2))
    std_list.append(np.round(s.std(), 4))

    outlier, new_mean, new_std = get_new_stat(s)
    outlier_list.append(outlier)
    new_mean_list.append(new_mean)
    new_std_list.append(new_std)

In [ ]:
df = pd.DataFrame({
    'species':  species_list,
    'feature':  feature_list,
    'mean'   :  mean_list,
    'std'    :  std_list,
    'outlier':  outlier_list,
    'new_mean': new_mean_list,
    'new_std':  new_std_list
})
df.set_index(['species', 'feature'], inplace=True)
df

# Q2

## a

In [ ]:
titanic = sns.load_dataset('titanic')
titanic

In [ ]:
titanic['category1'] = titanic.apply(lambda r: r.sex if r.age >= 20.0 else 'child', axis=1)
titanic

## b

In [ ]:
# fillna() 한 것을 titanic.age에 넣어줘야 한다.
titanic.age = titanic.age.fillna(titanic.age.mean())
titanic.tail()

# 위의 경우 age 29인데, child로 category1 되므로 위의 코드 다시 반복

In [ ]:
titanic['category1'] = titanic.apply(lambda r: r.sex if r.age >= 20.0 else 'child', axis=1)
titanic

## c

In [ ]:
# 'alive' : category, 'survived' : int
titanic.groupby('sex')[['survived']].mean()

In [ ]:
titanic.pivot_table('survived', 'class')

In [ ]:
titanic.groupby('embark_town')[['survived']].mean()

In [ ]:
titanic.pivot_table('survived', ['sex', 'class'])

In [ ]:
 titanic.pivot_table('survived', ['sex', 'class'], 'embark_town')

## d

In [ ]:
bins    = [1, 20, 30, 50, 70, 100]
labels  = ['미성년자', '청년', '중년', '장년', '노년']
titanic['age_cat'] = pd.cut(titanic.age, bins=bins, labels=labels)
titanic.tail()

In [ ]:
titanic.pivot_table('survived', 'age_cat')

In [ ]:
titanic.pivot_table('survived', ['sex', 'age_cat'])

## e

In [ ]:
titanic['age_group'] = pd.qcut(titanic.age, 3, labels=['A1', 'A2', 'A3'])
titanic.tail()

In [ ]:
titanic.pivot_table('survived', 'age_group')

In [ ]:
# 남 녀 성비 / 남자 : 1, 여자 : 0
titanic['gender'] = titanic.apply(lambda r: 1 if r.sex == 'male' else 0, axis=1)
titanic.tail()

In [ ]:
titanic.pivot_table('gender', 'age_group')

In [ ]:
titanic.pivot_table(['gender', 'survived'], 'age_group')

# Q3

## 1

In [16]:
 mpg = sns.load_dataset('mpg')
 mpg

      mpg  cylinders  ...  origin                       name
0    18.0          8  ...     usa  chevrolet chevelle malibu
1    15.0          8  ...     usa          buick skylark 320
2    18.0          8  ...     usa         plymouth satellite
3    16.0          8  ...     usa              amc rebel sst
4    17.0          8  ...     usa                ford torino
..    ...        ...  ...     ...                        ...
393  27.0          4  ...     usa            ford mustang gl
394  44.0          4  ...  europe                  vw pickup
395  32.0          4  ...     usa              dodge rampage
396  28.0          4  ...     usa                ford ranger
397  31.0          4  ...     usa                 chevy s-10

[398 rows x 9 columns]

In [23]:
mpg['hp_per_cc'] = mpg.horsepower / mpg.displacement
mpg

      mpg  cylinders  displacement  ...  hp_per_cc  manufacturer           model
0    18.0          8         307.0  ...   0.423453     chevrolet  chevellemalibu
1    15.0          8         350.0  ...   0.471429         buick      skylark320
2    18.0          8         318.0  ...   0.471698      plymouth       satellite
3    16.0          8         304.0  ...   0.493421           amc        rebelsst
4    17.0          8         302.0  ...   0.463576          ford          torino
..    ...        ...           ...  ...        ...           ...             ...
393  27.0          4         140.0  ...   0.614286          ford       mustanggl
394  44.0          4          97.0  ...   0.536082            vw          pickup
395  32.0          4         135.0  ...   0.622222         dodge         rampage
396  28.0          4         120.0  ...   0.658333          ford          ranger
397  31.0          4         119.0  ...   0.689076         chevy            s-10

[398 rows x 11 columns]

## 2

In [18]:
mpg['manufacturer'] = mpg.name.apply(lambda x: x.split()[0])
mpg['model'] = mpg.name.apply(lambda x: ''.join(x.split()[1:]))
mpg

      mpg  cylinders  displacement  ...  hp_per_cc  manufacturer           model
0    18.0          8         307.0  ...   0.423453     chevrolet  chevellemalibu
1    15.0          8         350.0  ...   0.471429         buick      skylark320
2    18.0          8         318.0  ...   0.471698      plymouth       satellite
3    16.0          8         304.0  ...   0.493421           amc        rebelsst
4    17.0          8         302.0  ...   0.463576          ford          torino
..    ...        ...           ...  ...        ...           ...             ...
393  27.0          4         140.0  ...   0.614286          ford       mustanggl
394  44.0          4          97.0  ...   0.536082            vw          pickup
395  32.0          4         135.0  ...   0.622222         dodge         rampage
396  28.0          4         120.0  ...   0.658333          ford          ranger
397  31.0          4         119.0  ...   0.689076         chevy            s-10

[398 rows x 12 columns]

In [19]:
del mpg['name']
mpg

      mpg  cylinders  displacement  ...  hp_per_cc  manufacturer           model
0    18.0          8         307.0  ...   0.423453     chevrolet  chevellemalibu
1    15.0          8         350.0  ...   0.471429         buick      skylark320
2    18.0          8         318.0  ...   0.471698      plymouth       satellite
3    16.0          8         304.0  ...   0.493421           amc        rebelsst
4    17.0          8         302.0  ...   0.463576          ford          torino
..    ...        ...           ...  ...        ...           ...             ...
393  27.0          4         140.0  ...   0.614286          ford       mustanggl
394  44.0          4          97.0  ...   0.536082            vw          pickup
395  32.0          4         135.0  ...   0.622222         dodge         rampage
396  28.0          4         120.0  ...   0.658333          ford          ranger
397  31.0          4         119.0  ...   0.689076         chevy            s-10

[398 rows x 11 columns]

## 3

In [20]:
mpg.pivot_table('mpg', 'cylinders')

                 mpg
cylinders
3          20.550000
4          29.286765
5          27.366667
6          19.985714
8          14.963107

## 4

In [21]:
mpg.pivot_table('hp_per_cc', 'origin')

        hp_per_cc
origin
europe   0.740005
japan    0.789485
usa      0.512063

## 5

In [22]:
mpg.groupby('manufacturer').model.value_counts()

manufacturer  model
amc           matador            5
              gremlin            4
              hornet             4
              concord            2
              matador(sw)        2
                                ..
vw            rabbit             2
              dasher(diesel)     1
              pickup             1
              rabbitc(diesel)    1
              rabbitcustom       1
Name: model, Length: 304, dtype: int64

In [28]:
# mpg[mpg.groupby('manufacturer').model.nunique() >= 5]
mpg.manufacturer.value_counts()

ford             51
chevrolet        43
plymouth         31
dodge            28
amc              28
toyota           25
datsun           23
buick            17
pontiac          16
volkswagen       15
honda            13
mercury          11
mazda            10
oldsmobile       10
fiat              8
peugeot           8
audi              7
vw                6
volvo             6
chrysler          6
renault           5
saab              4
subaru            4
opel              4
chevy             3
maxda             2
bmw               2
mercedes-benz     2
cadillac          2
hi                1
vokswagen         1
triumph           1
nissan            1
capri             1
mercedes          1
toyouta           1
chevroelt         1
Name: manufacturer, dtype: int64

In [27]:
s = mpg.manufacturer.value_counts()
big = s[s >= 5].index.to_list()
print(big)

['ford', 'chevrolet', 'plymouth', 'dodge', 'amc', 'toyota', 'datsun', 'buick', 'pontiac', 'volkswagen', 'honda', 'mercury', 'mazda', 'oldsmobile', 'fiat', 'peugeot', 'audi', 'vw', 'volvo', 'chrysler', 'renault']

In [29]:
# in 연산자 대신 isin() method 사용
mpg[mpg.manufacturer.isin(big)].head()

    mpg  cylinders  displacement  ...  hp_per_cc  manufacturer           model
0  18.0          8         307.0  ...   0.423453     chevrolet  chevellemalibu
1  15.0          8         350.0  ...   0.471429         buick      skylark320
2  18.0          8         318.0  ...   0.471698      plymouth       satellite
3  16.0          8         304.0  ...   0.493421           amc        rebelsst
4  17.0          8         302.0  ...   0.463576          ford          torino

[5 rows x 11 columns]

In [36]:
bigmpg = mpg[mpg.manufacturer.isin(big)]
bigmpg.pivot_table('mpg', 'manufacturer').sort_values('mpg', ascending=False).head(5)

                    mpg
manufacturer
vw            39.016667
honda         33.761538
renault       32.880000
datsun        31.113043
mazda         30.860000

In [37]:
mpg.groupby('manufacturer').filter(lambda x: x.manufacturer.count() >= 5)
bigmpg.pivot_table('mpg', 'manufacturer').sort_values('mpg', ascending=False).head(5)

                    mpg
manufacturer
vw            39.016667
honda         33.761538
renault       32.880000
datsun        31.113043
mazda         30.860000